test/request-response-samples/getAttachments__should_handle_not_MTOM_response/request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://www.examples.com/wsdl/MTOMService.wsdl"><soap:Body><tns:getAttachments><param>123</param></tns:getAttachments></soap:Body></soap:Envelope>